[
  { "id": 1, "titulo": "Tortilla de Patatas", "descripcion": "Clásico de la gastronomía española, un aperitivo o plato principal que nunca falla.", "ingredientes": "Patatas, huevos, cebolla, aceite de oliva, sal.", "instrucciones": "Freír las patatas y la cebolla, mezclarlas con los huevos batidos, cuajar en una sartén por ambos lados.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=1" },
  { "id": 2, "titulo": "Gambas al Ajillo", "descripcion": "Delicioso plato de gambas salteadas con ajo y guindilla en aceite de oliva.", "ingredientes": "Gambas, ajo, aceite de oliva, guindilla, perejil.", "instrucciones": "En una cazuela de barro, freír el ajo y la guindilla. Añadir las gambas, cocinar rápidamente y espolvorear perejil.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=2" },
  { "id": 3, "titulo": "Patatas Bravas", "descripcion": "Trozos de patata frita bañados en una salsa picante y, a menudo, con alioli.", "ingredientes": "Patatas, aceite para freír, salsa brava, alioli.", "instrucciones": "Freír las patatas en cubos. Cubrir con salsa brava y un toque de alioli.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=3" },
  { "id": 4, "titulo": "Croquetas de Jamón", "descripcion": "Bechamel cremosa con trozos de jamón, rebozada y frita.", "ingredientes": "Harina, leche, mantequilla, jamón ibérico, pan rallado, huevo, aceite.", "instrucciones": "Preparar la bechamel con jamón, dejar enfriar, formar las croquetas, rebozar y freír.", "categoria": "Aperitivo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=4" },
  { "id": 5, "titulo": "Pulpo a la Gallega", "descripcion": "Pulpo cocido, cortado en rodajas y sazonado con pimentón, sal y aceite de oliva.", "ingredientes": "Pulpo, patatas, pimentón dulce, sal gorda, aceite de oliva.", "instrucciones": "Cocer el pulpo, cortar y servir sobre patatas cocidas, aliñar.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=5" },
  { "id": 6, "titulo": "Pan con Tomate", "descripcion": "Un simple y delicioso clásico catalán: pan tostado, tomate, aceite y sal.", "ingredientes": "Pan, tomate maduro, aceite de oliva, sal.", "instrucciones": "Tostar el pan, frotar con tomate, añadir aceite y sal.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=6" },
  { "id": 7, "titulo": "Pimientos de Padrón", "descripcion": "Pequeños pimientos fritos en aceite, unos pican y otros no.", "ingredientes": "Pimientos de Padrón, aceite de oliva, sal gorda.", "instrucciones": "Freír los pimientos hasta que se doren, escurrir y espolvorear sal gorda.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=7" },
  { "id": 8, "titulo": "Huevos Rotos con Jamón", "descripcion": "Patatas fritas con huevos fritos encima y trozos de jamón.", "ingredientes": "Patatas, huevos, jamón serrano, aceite de oliva, sal.", "instrucciones": "Freír las patatas en tiras, freír los huevos, romperlos sobre las patatas y añadir el jamón.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=8" },
  { "id": 9, "titulo": "Ensaladilla Rusa", "descripcion": "Ensalada fría de patatas, atún, zanahoria, guisantes, huevo duro y mayonesa.", "ingredientes": "Patatas, zanahoria, guisantes, atún, huevo, mayonesa, aceitunas.", "instrucciones": "Cocer las patatas, zanahoria y huevos. Picar todo y mezclar con atún y mayonesa.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=9" },
  { "id": 10, "titulo": "Chorizo a la Sidra", "descripcion": "Chorizo cocinado en sidra natural hasta que esté tierno y sabroso.", "ingredientes": "Chorizo, sidra natural.", "instrucciones": "Cortar el chorizo en rodajas, cocer en sidra a fuego lento hasta que se reduzca.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=10" },
  { "id": 11, "titulo": "Boquerones en Vinagre", "descripcion": "Filetes de boquerón marinados en vinagre, ajo y perejil.", "ingredientes": "Boquerones, vinagre de vino blanco, aceite de oliva, ajo, perejil, sal.", "instrucciones": "Limpiar los boquerones, marinarlos en vinagre, luego aliñar con ajo, perejil y aceite.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=11" },
  { "id": 12, "titulo": "Calamares a la Romana", "descripcion": "Anillas de calamar rebozadas y fritas, crujientes por fuera y tiernas por dentro.", "ingredientes": "Anillas de calamar, harina, huevo, aceite para freír, limón.", "instrucciones": "Rebozar las anillas de calamar en harina y huevo, freír en aceite caliente y servir con limón.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=12" },
  { "id": 13, "titulo": "Sepia a la Plancha", "descripcion": "Trozos de sepia cocinados en la plancha con ajo y perejil.", "ingredientes": "Sepia, ajo, perejil, aceite de oliva, sal.", "instrucciones": "Limpiar la sepia, cortarla y cocinarla en la plancha con ajo y perejil picados.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=13" },
  { "id": 14, "titulo": "Queso Manchego con Membrillo", "descripcion": "Una combinación dulce y salada, muy popular en la región de La Mancha.", "ingredientes": "Queso manchego curado, dulce de membrillo.", "instrucciones": "Cortar el queso y el membrillo en lonchas o cubos, y servir juntos.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=14" },
  { "id": 15, "titulo": "Aceitunas Aliñadas", "descripcion": "Aceitunas maceradas en una mezcla de ajo, pimentón, orégano y aceite de oliva.", "ingredientes": "Aceitunas, ajo, orégano, pimentón, aceite de oliva.", "instrucciones": "Mezclar las aceitunas con el ajo picado, orégano, pimentón y un chorro de aceite. Dejar macerar.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=15" },
  { "id": 61, "titulo": "Champiñones al Ajillo", "descripcion": "Champiñones laminados y salteados con ajo y perejil, una tapa clásica y rápida.", "ingredientes": "Champiñones, ajo, perejil, aceite de oliva, vino blanco, sal.", "instrucciones": "Saltear ajos laminados en aceite, añadir los champiñones y cocinar. Incorporar vino blanco, reducir y añadir perejil.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=61" },
  { "id": 62, "titulo": "Mejillones a la Vinagreta", "descripcion": "Mejillones cocidos al vapor y servidos fríos con una vinagreta de pimientos y cebolla.", "ingredientes": "Mejillones, pimiento rojo, pimiento verde, cebolleta, vinagre, aceite de oliva, sal.", "instrucciones": "Cocer los mejillones al vapor. Picar finamente las verduras y mezclar con aceite, vinagre y sal. Servir sobre los mejillones.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=62" },
  { "id": 63, "titulo": "Pincho Moruno", "descripcion": "Brocheta de carne de cerdo adobada con especias morunas y hecha a la plancha.", "ingredientes": "Carne de cerdo, pimentón, comino, cúrcuma, ajo, aceite de oliva, sal.", "instrucciones": "Adobar la carne en dados con las especias y aceite. Ensartar en brochetas y cocinar a la plancha.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=63" },
  { "id": 64, "titulo": "Buñuelos de Bacalao", "descripcion": "Pequeñas porciones de masa frita con bacalao desmigado, tiernos por dentro y crujientes por fuera.", "ingredientes": "Bacalao desalado, harina, huevo, levadura, ajo, perejil, agua con gas.", "instrucciones": "Mezclar el bacalao desmigado con la masa de harina, huevo y levadura. Añadir ajo y perejil. Freír por cucharadas en aceite caliente.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=64" },
  { "id": 65, "titulo": "Tigres o Mejillones Rellenos", "descripcion": "Mejillones rellenos de una bechamel picante, rebozados y fritos.", "ingredientes": "Mejillones, cebolla, harina, leche, pimiento, guindilla, pan rallado, huevo.", "instrucciones": "Hacer una bechamel con un sofrito de cebolla y pimiento. Añadir los mejillones picados. Rellenar las conchas, rebozar y freír.", "categoria": "Aperitivo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=65" },
  { "id": 66, "titulo": "Gildas", "descripcion": "La banderilla más famosa del País Vasco, con aceituna, guindilla de Ibarra y anchoa.", "ingredientes": "Aceitunas verdes sin hueso, guindillas de Ibarra en vinagre, filetes de anchoa en aceite.", "instrucciones": "Ensartar en un palillo una aceituna, una guindilla doblada y una anchoa enrollada. Terminar con otra aceituna.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=66" },
  { "id": 67, "titulo": "Zamburiñas a la Plancha", "descripcion": "Zamburiñas frescas cocinadas a la plancha con un toque de ajo, perejil y limón.", "ingredientes": "Zamburiñas, ajo, perejil, aceite de oliva, limón, sal.", "instrucciones": "Calentar una plancha con aceite. Cocinar las zamburiñas vuelta y vuelta. Servir con una picada de ajo, perejil y un chorrito de limón.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=67" },
  { "id": 68, "titulo": "Montadito de Pringá", "descripcion": "Pequeño bocadillo caliente relleno de 'pringá', la mezcla de carnes del cocido andaluz.", "ingredientes": "Pan de mollete, pringá (carnes del cocido desmigadas: tocino, morcilla, chorizo, ternera).", "instrucciones": "Calentar la pringá. Abrir un mollete pequeño, untar la pringá y servir caliente.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=68" },
  { "id": 69, "titulo": "Berenjenas con Miel de Caña", "descripcion": "Bastones de berenjena fritos y crujientes, servidos con un chorrito de miel de caña.", "ingredientes": "Berenjena, harina, cerveza o agua con gas, sal, aceite para freír, miel de caña.", "instrucciones": "Cortar la berenjena en bastones. Pasar por una masa de harina y líquido. Freír hasta que estén dorados y servir con miel de caña.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=69" },
  { "id": 70, "titulo": "Matrimonio", "descripcion": "Tapa que combina una anchoa en salazón con un boquerón en vinagre sobre pan.", "ingredientes": "Pan, anchoa en salazón, boquerón en vinagre, aceite de oliva.", "instrucciones": "Colocar sobre una rebanada de pan un filete de anchoa y un filete de boquerón en vinagre. Rociar con aceite de oliva.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=70" },
  { "id": 71, "titulo": "Salpicón de Marisco", "descripcion": "Ensalada fría con pulpo, gambas y mejillones, aliñada con una vinagreta de verduras.", "ingredientes": "Pulpo cocido, gambas cocidas, mejillones al vapor, pimiento rojo y verde, cebolleta, aceite, vinagre, sal.", "instrucciones": "Picar los mariscos y las verduras en trozos pequeños. Mezclar y aliñar con la vinagreta. Servir frío.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=71" },
  { "id": 72, "titulo": "Zarajos", "descripcion": "Tapa típica de Cuenca, son intestinos de cordero lechal marinados y enrollados en un sarmiento, luego fritos o asados.", "ingredientes": "Intestinos de cordero lechal, ajo, perejil, vinagre, sarmientos.", "instrucciones": "Marinar los intestinos. Enrollarlos en los sarmientos y freír en abundante aceite o asar a la brasa.", "categoria": "Aperitivo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=72" },
  { "id": 73, "titulo": "Papas Aliñás", "descripcion": "Ensalada de patatas cocidas típica de Cádiz, aliñada con aceite, vinagre, perejil, cebolleta y atún.", "ingredientes": "Patatas, cebolleta, perejil, atún en aceite, aceite de oliva virgen extra, vinagre de Jerez, sal.", "instrucciones": "Cocer las patatas y cortarlas en rodajas. Añadir el resto de ingredientes picados y aliñar generosamente. Servir templada o fría.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=73" },
  { "id": 74, "titulo": "Tosta de Escalivada con Anchoas", "descripcion": "Rebanada de pan tostado cubierta con escalivada (pimientos, berenjena y cebolla asados) y anchoas.", "ingredientes": "Pan de payés, pimiento rojo, berenjena, cebolla, anchoas, aceite de oliva, sal.", "instrucciones": "Asar las verduras, pelarlas y cortarlas en tiras. Colocar sobre una tostada de pan y añadir un par de anchoas por encima.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=74" },
  { "id": 75, "titulo": "Caracoles a la Andaluza", "descripcion": "Caracoles guisados en un caldo sabroso con hierbas aromáticas y un toque de picante.", "ingredientes": "Caracoles, ajo, cebolla, pimiento, guindilla, hierbabuena, poleo, comino, pan.", "instrucciones": "Lavar bien los caracoles. Cocerlos en un caldo preparado con un sofrito de verduras y las hierbas. Espesar la salsa con pan frito.", "categoria": "Aperitivo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=75" },
  { "id": 76, "titulo": "Soldaditos de Pavía", "descripcion": "Tiras de bacalao rebozadas y fritas, a menudo acompañadas de una tira de pimiento rojo.", "ingredientes": "Bacalao desalado, harina, levadura o azafrán, aceite para freír, pimiento rojo asado.", "instrucciones": "Cortar el bacalao en tiras. Preparar una masa para rebozar. Rebozar el bacalao y freír. Servir con tiras de pimiento rojo.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=76" },
  { "id": 77, "titulo": "Queso frito con Mermelada", "descripcion": "Tacos de queso semicurado rebozados y fritos, servidos calientes con mermelada de arándanos o tomate.", "ingredientes": "Queso semicurado, huevo, pan rallado, aceite para freír, mermelada de arándanos.", "instrucciones": "Cortar el queso en tacos. Pasar por huevo y pan rallado. Freír hasta que estén dorados. Servir inmediatamente con mermelada.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=77" },
  { "id": 78, "titulo": "Coquinas al Ajillo", "descripcion": "Coquinas (o tellinas) salteadas en una sartén con ajo, guindilla y vino blanco.", "ingredientes": "Coquinas, ajo, guindilla, vino blanco, perejil, aceite de oliva, sal.", "instrucciones": "Dejar las coquinas en agua con sal para que suelten la arena. Saltear ajo y guindilla, añadir las coquinas y el vino. Tapar hasta que se abran.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=78" },
  { "id": 79, "titulo": "Espárragos con Mayonesa", "descripcion": "Espárragos blancos gruesos de lata o frasco, servidos fríos con mayonesa casera.", "ingredientes": "Espárragos blancos en conserva, huevo, aceite de girasol, vinagre, sal.", "instrucciones": "Escurrir bien los espárragos. Preparar una mayonesa casera. Servir los espárragos fríos con una cucharada de mayonesa por encima.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=79" },
  { "id": 80, "titulo": "Morcilla de Burgos Frita", "descripcion": "Rodajas de morcilla de Burgos (con arroz) fritas en la sartén hasta que estén crujientes por fuera.", "ingredientes": "Morcilla de Burgos, aceite de oliva.", "instrucciones": "Cortar la morcilla en rodajas de 1-2 cm de grosor. Freír en una sartén con poco aceite, vuelta y vuelta, hasta que se forme una costra.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=80" },
  { "id": 81, "titulo": "Pinchos de Chistorra", "descripcion": "Trozos de chistorra frita o a la plancha, servidos ensartados en un palillo sobre una rebanada de pan.", "ingredientes": "Chistorra, pan, aceite de oliva.", "instrucciones": "Cortar la chistorra en trozos de unos 4-5 cm. Freír en su propia grasa. Escurrir y servir sobre una rebanada de pan, sujetando con un palillo.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=81" },
  { "id": 82, "titulo": "Tapa de Atún con Pimientos", "descripcion": "Una conserva de atún en aceite o escabeche servida sobre pan con tiras de pimiento rojo asado.", "ingredientes": "Lata de atún o melva, pimientos del piquillo, pan, aceite de oliva.", "instrucciones": "Escurrir el atún. Tostar una rebanada de pan. Colocar el atún desmigado sobre el pan y decorar con unas tiras de pimiento del piquillo.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=82" },
  { "id": 83, "titulo": "Cazón en Adobo (Bienmesabe)", "descripcion": "Tacos de cazón marinados en un adobo de especias y vinagre, luego rebozados y fritos. Típico de Andalucía.", "ingredientes": "Cazón, ajo, pimentón, orégano, comino, vinagre, harina, aceite para freír.", "instrucciones": "Cortar el cazón en tacos y dejar marinar en el adobo durante al menos 8 horas. Escurrir, enharinar y freír en aceite caliente.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=83" },
  { "id": 84, "titulo": "Huevos Rellenos de Atún", "descripcion": "Huevos duros partidos por la mitad, rellenos de una mezcla de sus propias yemas, atún y mayonesa.", "ingredientes": "Huevos, atún en lata, mayonesa, aceitunas, sal.", "instrucciones": "Cocer los huevos. Partirlos por la mitad y extraer las yemas. Mezclar las yemas con atún y mayonesa. Rellenar las claras y decorar.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=84" },
  { "id": 85, "titulo": "Torreznos de Soria", "descripcion": "Panceta de cerdo adobada y frita lentamente hasta conseguir una corteza muy crujiente y un interior tierno.", "ingredientes": "Panceta adobada de Soria, aceite de girasol.", "instrucciones": "Orear la panceta. Freír a fuego bajo en aceite hasta que la corteza sufle y se llene de burbujas. Subir el fuego al final para dorar.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=85" },
  { "id": 86, "titulo": "Empanadillas de Atún", "descripcion": "Clásicas empanadillas caseras rellenas de un sofrito de atún, tomate, huevo duro y pimientos.", "ingredientes": "Obleas para empanadillas, atún en lata, tomate frito, huevo duro, pimiento morrón, cebolla.", "instrucciones": "Hacer un sofrito con la cebolla y el pimiento. Mezclar con el atún, tomate y huevo duro picado. Rellenar las obleas, sellar y freír.", "categoria": "Aperitivo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=86" },
  { "id": 87, "titulo": "Banderillas", "descripcion": "Pinchos fríos que combinan encurtidos como pepinillos, cebolletas, aceitunas y pimientos en un palillo.", "ingredientes": "Pepinillos en vinagre, aceitunas, cebolletas en vinagre, trozos de pimiento, anchoas.", "instrucciones": "Ensartar los diferentes ingredientes en un palillo de forma alterna para combinar sabores y colores.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=87" },
  { "id": 88, "titulo": "Carne Mechada", "descripcion": "Pieza de lomo de cerdo cocinada en su jugo con especias y luego fileteada finamente, servida como tapa fría.", "ingredientes": "Lomo de cerdo, manteca de cerdo, ajo, vino blanco, laurel, clavo, pimienta.", "instrucciones": "Mechar la carne con ajo y tocino. Dorarla y cocerla lentamente en manteca con vino y especias. Dejar enfriar y cortar en lonchas finas.", "categoria": "Aperitivo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=88" },
  { "id": 89, "titulo": "Torta del Casar", "descripcion": "Queso cremoso de oveja de Extremadura, servido a temperatura ambiente para untar en pan.", "ingredientes": "Torta del Casar, picos de pan o pan tostado.", "instrucciones": "Cortar la tapa superior del queso. Servir a temperatura ambiente para que el interior esté cremoso y se pueda untar.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=89" },
  { "id": 90, "titulo": "Almendras Fritas", "descripcion": "Almendras crudas fritas en aceite de oliva y sazonadas con sal gorda.", "ingredientes": "Almendras crudas (tipo Marcona), aceite de oliva, sal gorda.", "instrucciones": "Freír las almendras en aceite caliente, sin dejar de remover, hasta que estén doradas. Escurrir y echar sal gorda inmediatamente.", "categoria": "Aperitivo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=90" },
  { "id": 16, "titulo": "Gazpacho Andaluz", "descripcion": "Sopa fría de tomate, pimiento, pepino y ajo, ideal para el verano.", "ingredientes": "Tomates maduros, pimiento verde, pepino, cebolla, ajo, aceite de oliva, vinagre de jerez, sal, pan duro.", "instrucciones": "Triturar todos los ingredientes. Colar y servir muy frío.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=16" },
  { "id": 17, "titulo": "Salmorejo Cordobés", "descripcion": "Crema espesa de tomate, pan, aceite de oliva y ajo, servida con jamón y huevo duro.", "ingredientes": "Tomates, pan, ajo, aceite de oliva virgen extra, vinagre, sal, jamón serrano, huevo duro.", "instrucciones": "Triturar los tomates con el pan remojado, ajo, aceite y sal. Servir frío con guarnición.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=17" },
  { "id": 18, "titulo": "Cocido Madrileño", "descripcion": "Potaje de garbanzos con verduras, carne de ternera, cerdo y embutidos.", "ingredientes": "Garbanzos, carne (morcillo, pollo, tocino), embutidos (chorizo, morcilla), verduras (patata, zanahoria, repollo).", "instrucciones": "Cocer los garbanzos y las carnes en una olla grande. Servir en tres vuelcos: sopa, garbanzos y carnes.", "categoria": "Primero", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=18" },
  { "id": 19, "titulo": "Fabada Asturiana", "descripcion": "Potaje tradicional con fabes (judías blancas), chorizo, morcilla y panceta.", "ingredientes": "Fabes asturianas, chorizo, morcilla, panceta, lacón, azafrán, ajo, cebolla.", "instrucciones": "Cocer las fabes con las carnes a fuego lento hasta que estén tiernas. Servir caliente.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=19" },
  { "id": 20, "titulo": "Lentejas con Chorizo", "descripcion": "Un guiso tradicional y reconfortante de lentejas, chorizo y verduras.", "ingredientes": "Lentejas, chorizo, cebolla, zanahoria, ajo, pimiento, tomate, laurel.", "instrucciones": "Sofreír las verduras, añadir las lentejas, el chorizo y agua. Cocinar a fuego lento.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=20" },
  { "id": 21, "titulo": "Sopa de Ajo", "descripcion": "Sopa humilde pero sabrosa a base de ajo, pan duro, pimentón y jamón, con un huevo escalfado.", "ingredientes": "Pan duro, ajo, aceite de oliva, pimentón, jamón serrano, huevos, agua.", "instrucciones": "Dorar el ajo y el pan, añadir pimentón, agua y jamón. Cocer y añadir un huevo al final.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=21" },
  { "id": 22, "titulo": "Migas Manchegas", "descripcion": "Pan duro troceado, frito con ajo, panceta y chorizo. Un plato de pastores.", "ingredientes": "Pan duro, panceta, chorizo, ajo, aceite de oliva, pimentón.", "instrucciones": "Remojar el pan, freír el ajo, panceta y chorizo. Añadir el pan y remover hasta que estén doradas.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=22" },
  { "id": 23, "titulo": "Sopa de Pescado y Marisco", "descripcion": "Sopa reconfortante con una variedad de pescados y mariscos en un caldo sabroso.", "ingredientes": "Pescado (merluza), marisco (gambas, almejas), caldo de pescado, ajo, cebolla, pimiento, tomate.", "instrucciones": "Sofreír las verduras, añadir el caldo y el pescado/marisco. Cocinar unos minutos.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=23" },
  { "id": 24, "titulo": "Crema de Verduras", "descripcion": "Una crema casera y saludable, ideal para cualquier época del año.", "ingredientes": "Verduras variadas (calabacín, puerro, patata), caldo, aceite de oliva, sal.", "instrucciones": "Cocer las verduras en el caldo, triturar y aliñar al gusto.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=24" },
  { "id": 25, "titulo": "Espinacas con Garbanzos", "descripcion": "Plato andaluz de espinacas y garbanzos guisados con especias y un toque de comino.", "ingredientes": "Garbanzos cocidos, espinacas, ajo, pan, comino, pimentón, aceite de oliva.", "instrucciones": "Sofreír el ajo, añadir las espinacas y garbanzos. Condimentar con especias.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=25" },
  { "id": 26, "titulo": "Judías Verdes con Patatas y Jamón", "descripcion": "Un plato sencillo y nutritivo con judías verdes, patatas cocidas y un sofrito de ajo y jamón.", "ingredientes": "Judías verdes, patatas, jamón serrano, ajo, aceite de oliva.", "instrucciones": "Cocer las judías y patatas. En una sartén, freír ajo y jamón. Mezclar todo.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=26" },
  { "id": 27, "titulo": "Porrusalda", "descripcion": "Sopa de puerros y patatas típica del País Vasco, a menudo con bacalao.", "ingredientes": "Puerros, patatas, bacalao (opcional), ajo, aceite de oliva, caldo de pescado.", "instrucciones": "Sofreír el ajo y los puerros. Añadir las patatas y el caldo. Cocinar hasta que estén tiernas.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=27" },
  { "id": 28, "titulo": "Pisto Manchego", "descripcion": "Clásico plato de verduras salteadas: tomate, pimiento, cebolla, calabacín.", "ingredientes": "Tomate, pimiento, calabacín, cebolla, aceite de oliva, sal.", "instrucciones": "Cortar las verduras en dados y pocharlas lentamente en aceite de oliva hasta que estén tiernas.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=28" },
  { "id": 29, "titulo": "Arroz a la Cubana", "descripcion": "Plato de arroz blanco con tomate frito, un huevo frito y plátano frito.", "ingredientes": "Arroz, tomate frito, huevos, plátano macho, aceite.", "instrucciones": "Cocer el arroz, freír el huevo y el plátano. Servir todo junto con el tomate.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=29" },
  { "id": 30, "titulo": "Marmitako", "descripcion": "Guiso de bonito del norte con patatas, cebolla, pimiento y tomate, típico del País Vasco.", "ingredientes": "Bonito, patatas, cebolla, pimiento, tomate, aceite de oliva, caldo de pescado.", "instrucciones": "Hacer un sofrito con las verduras, añadir las patatas, el caldo y el bonito al final.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=30" },
  { "id": 91, "titulo": "Ajoblanco", "descripcion": "Sopa fría de Málaga a base de almendras, ajo y pan, servida a menudo con uvas o melón.", "ingredientes": "Almendras crudas, miga de pan, ajo, aceite de oliva, vinagre, agua, sal.", "instrucciones": "Triturar las almendras, el ajo y el pan con agua, aceite, vinagre y sal hasta obtener una crema fina. Servir muy fría.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=91" },
  { "id": 92, "titulo": "Paella de Marisco", "descripcion": "Versión de la paella con arroz, mariscos como gambas, calamares y mejillones, y un sabroso fumet de pescado.", "ingredientes": "Arroz bomba, caldo de pescado (fumet), calamares, gambas, mejillones, pimiento, tomate, azafrán, aceite de oliva.", "instrucciones": "Hacer un sofrito con las verduras. Añadir el calamar y el arroz, y nacarar. Verter el caldo caliente con azafrán. Añadir las gambas y mejillones al final.", "categoria": "Primero", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=92" },
  { "id": 93, "titulo": "Arroz Negro", "descripcion": "Arroz cocinado con tinta de calamar, que le da su color y sabor característicos, a menudo servido con alioli.", "ingredientes": "Arroz, calamares o sepia, tinta de calamar, fumet de pescado, cebolla, ajo, pimiento.", "instrucciones": "Hacer un sofrito. Añadir los calamares y el arroz. Incorporar la tinta disuelta en el fumet caliente. Cocinar hasta que el arroz esté en su punto.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=93" },
  { "id": 94, "titulo": "Ensalada Mixta", "descripcion": "La ensalada más clásica de España, con lechuga, tomate, cebolla, atún, huevo duro, espárragos y aceitunas.", "ingredientes": "Lechuga, tomate, cebolla, atún en aceite, huevo duro, espárragos blancos, aceitunas.", "instrucciones": "Lavar y cortar la lechuga, el tomate y la cebolla. Colocar en una fuente y añadir el resto de ingredientes por encima. Aliñar al gusto.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=94" },
  { "id": 95, "titulo": "Sopa de Fideos", "descripcion": "Una sopa casera y reconfortante a base de un buen caldo de pollo o cocido con fideos finos.", "ingredientes": "Caldo de pollo o cocido, fideos finos (cabellín), hierbabuena (opcional).", "instrucciones": "Llevar el caldo a ebullición. Añadir los fideos y cocer el tiempo que indique el paquete (normalmente 2-3 minutos). Servir caliente.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=95" },
  { "id": 96, "titulo": "Potaje de Garbanzos", "descripcion": "Guiso de garbanzos tradicional, a menudo acompañado de espinacas y bacalao, típico de la vigilia.", "ingredientes": "Garbanzos, espinacas, bacalao desalado, cebolla, ajo, pimentón, huevo duro.", "instrucciones": "Cocer los garbanzos. Hacer un sofrito con ajo, cebolla y pimentón. Añadir el sofrito, las espinacas y el bacalao a los garbanzos y cocer todo junto.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=96" },
  { "id": 97, "titulo": "Caldo Gallego", "descripcion": "Sopa contundente de Galicia con grelos o nabizas, patatas, alubias blancas y unto (grasa de cerdo).", "ingredientes": "Grelos o nabizas, patatas, alubias blancas, unto, chorizo, lacón.", "instrucciones": "Cocer las alubias y las carnes. Añadir las patatas y las verduras (grelos) y cocer hasta que todo esté tierno. El unto le da el sabor característico.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=97" },
  { "id": 98, "titulo": "Menestra de Verduras", "descripcion": "Plato que combina diferentes verduras de temporada (alcachofas, guisantes, habas, espárragos) guisadas, a menudo con jamón.", "ingredientes": "Alcachofas, guisantes, habas, espárragos, jamón serrano, cebolla, ajo, harina, vino blanco.", "instrucciones": "Cocer las verduras por separado. Hacer un sofrito con ajo, cebolla y jamón. Añadir una cucharada de harina y el vino. Incorporar las verduras y cocer todo junto.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=98" },
  { "id": 99, "titulo": "Macarrones con Chorizo", "descripcion": "Un plato de pasta clásico y contundente, con una salsa de tomate frito y chorizo.", "ingredientes": "Macarrones, chorizo, tomate frito, cebolla, queso rallado, orégano.", "instrucciones": "Cocer la pasta. Mientras, hacer un sofrito de cebolla, añadir el chorizo en rodajas y el tomate frito. Mezclar con los macarrones y gratinar con queso.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=99" },
  { "id": 100, "titulo": "Alcachofas con Jamón", "descripcion": "Corazones de alcachofa cocidos y luego salteados con ajos y taquitos de jamón serrano.", "ingredientes": "Alcachofas, jamón serrano, ajo, vino blanco, aceite de oliva.", "instrucciones": "Limpiar y cocer las alcachofas. En una sartén, dorar ajos laminados, añadir el jamón y las alcachofas partidas. Regar con vino y dejar reducir.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=100" },
  { "id": 101, "titulo": "Habas a la Catalana", "descripcion": "Guiso de habas tiernas con butifarra negra, panceta, ajo y hierbabuena.", "ingredientes": "Habas tiernas, butifarra negra, panceta, cebolla, ajo, hierbabuena, anís.", "instrucciones": "Hacer un sofrito con la panceta, cebolla y ajo. Añadir las habas y cocer lentamente. Al final, añadir la butifarra negra y la hierbabuena.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=101" },
  { "id": 102, "titulo": "Fideus Rossejats", "descripcion": "Plato marinero donde los fideos se tuestan primero en aceite y luego se cuecen en caldo de pescado.", "ingredientes": "Fideos finos (nº2), caldo de pescado, sepia, gambas, ajo, tomate.", "instrucciones": "Dorar ('rossejar') los fideos en la paella con aceite. Retirar. Hacer un sofrito, añadir la sepia. Volver a poner los fideos, verter el caldo caliente y cocer.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=102" },
  { "id": 103, "titulo": "Canelones de Carne", "descripcion": "Placas de pasta rellenas de carne asada y picada, cubiertas con bechamel y queso, y gratinadas al horno.", "ingredientes": "Placas de canelones, carne asada (ternera, cerdo, pollo), cebolla, tomate, bechamel, queso para gratinar.", "instrucciones": "Preparar el relleno picando la carne con su sofrito. Cocer las placas y rellenarlas. Cubrir con bechamel y queso, y gratinar.", "categoria": "Primero", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=103" },
  { "id": 104, "titulo": "Crema de Champiñones", "descripcion": "Crema suave y sabrosa elaborada con champiñones frescos, nata y un sofrito de puerro o cebolla.", "ingredientes": "Champiñones, puerro, patata, nata líquida, caldo de ave, aceite de oliva, sal.", "instrucciones": "Hacer un sofrito con el puerro. Añadir los champiñones y la patata. Cubrir con caldo y cocer. Triturar y añadir la nata.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=104" },
  { "id": 105, "titulo": "Ensalada Campera", "descripcion": "Ensalada de verano a base de patata cocida, pimiento, tomate, cebolla, huevo duro y atún.", "ingredientes": "Patatas, pimiento rojo y verde, tomate, cebolleta, huevos duros, atún, aceitunas.", "instrucciones": "Cocer las patatas y los huevos. Cortar todos los ingredientes en dados pequeños, mezclar en un bol y aliñar generosamente.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=105" },
  { "id": 106, "titulo": "Sopa de Marisco", "descripcion": "Una sopa rica y llena de sabor, elaborada con un buen fumet y trozos de pescado y marisco.", "ingredientes": "Caldo de pescado, gambas, almejas, mejillones, rape, cebolla, tomate, brandy.", "instrucciones": "Hacer un sofrito y flambear con brandy. Añadir el caldo. Incorporar el pescado y el marisco y cocer unos minutos hasta que se abra.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=106" },
  { "id": 107, "titulo": "Patatas a la Riojana", "descripcion": "Guiso tradicional de patatas con chorizo y pimiento choricero, originario de La Rioja.", "ingredientes": "Patatas, chorizo, pimiento choricero, cebolla, ajo, laurel, pimentón.", "instrucciones": "Hacer un sofrito con ajo y cebolla. Añadir el chorizo y el pimentón. Incorporar las patatas 'chascadas' y la pulpa del pimiento choricero. Cubrir de agua y guisar.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=107" },
  { "id": 108, "titulo": "Vichyssoise", "descripcion": "Crema fría de puerros y patata, de origen francés pero muy popular en España.", "ingredientes": "Puerros (la parte blanca), patata, cebolla, nata líquida, caldo de pollo, mantequilla.", "instrucciones": "Pochar las verduras en mantequilla. Añadir la patata y el caldo, y cocer. Triturar finamente, añadir la nata y dejar enfriar. Servir fría.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=108" },
  { "id": 109, "titulo": "Trinxat de la Cerdanya", "descripcion": "Plato pirenaico a base de col de invierno, patata y panceta, similar a una tortilla.", "ingredientes": "Col de invierno, patatas, panceta, ajos.", "instrucciones": "Cocer la col y la patata. Escurrir y 'trinxar' (picar) con un tenedor. Saltear ajos y panceta. Incorporar la mezcla de col y patata y dorar por ambos lados.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=109" },
  { "id": 110, "titulo": "Arroz con Costra", "descripcion": "Arroz al horno típico de Elche, cubierto con una costra de huevo batido que se cuaja al final.", "ingredientes": "Arroz, pollo, conejo, embutidos (blanco, negro), garbanzos, huevo, caldo de carne.", "instrucciones": "Sofreír las carnes y embutidos. Añadir el arroz y el caldo, y empezar la cocción al fuego. Pasar al horno y, casi al final, verter el huevo batido por encima para crear la costra.", "categoria": "Primero", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=110" },
  { "id": 111, "titulo": "Escudella i Carn d'Olla", "descripcion": "Cocido tradicional catalán, servido en dos partes: primero la sopa con galets y luego las carnes ('carn d'olla').", "ingredientes": "Ternera, pollo, butifarra, pilota (carne picada), garbanzos, patata, col, zanahoria, pasta de galets.", "instrucciones": "Hacer un caldo cociendo las carnes y verduras. Colar el caldo y cocer en él la pasta. Servir la sopa primero, y luego las carnes y verduras.", "categoria": "Primero", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=111" },
  { "id": 112, "titulo": "Purrusalda", "descripcion": "Sopa de puerros y patatas típica del País Vasco, a menudo con bacalao.", "ingredientes": "Puerros, patatas, bacalao (opcional), ajo, aceite de oliva, caldo de pescado.", "instrucciones": "Sofreír el ajo y los puerros. Añadir las patatas y el caldo. Cocinar hasta que estén tiernas.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=112" },
  { "id": 113, "titulo": "Calçots con Salsa Romesco", "descripcion": "Cebolletas tiernas asadas a la brasa y servidas con una salsa romesco para mojar.", "ingredientes": "Calçots, salsa romesco (tomates, ñoras, almendras, avellanas, ajo, pan, vinagre).", "instrucciones": "Asar los calçots directamente sobre las llamas hasta que estén negros por fuera y tiernos por dentro. Envolver en papel de periódico. Servir con salsa romesco.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=113" },
  { "id": 114, "titulo": "Pimientos Rellenos de Arroz", "descripcion": "Pimientos rojos asados y rellenos de un guiso de arroz con carne o verduras.", "ingredientes": "Pimientos rojos para asar, arroz, carne picada, cebolla, tomate, vino blanco.", "instrucciones": "Asar los pimientos y reservar. Hacer un sofrito y añadir la carne y el arroz. Precocer el arroz. Rellenar los pimientos y hornear.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=114" },
  { "id": 115, "titulo": "Olla Podrida", "descripcion": "Cocido contundente de Burgos, a base de alubias rojas y una gran variedad de carnes y embutidos de cerdo.", "ingredientes": "Alubias rojas de Ibeas, morcilla, chorizo, costilla, panceta, oreja, morro de cerdo.", "instrucciones": "Cocer las alubias. En otra olla, cocer todas las carnes. Servir las alubias primero y luego la carne (el 'compango').", "categoria": "Primero", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=115" },
  { "id": 116, "titulo": "Empedrat", "descripcion": "Ensalada fría catalana de alubias blancas con bacalao desmigado, pimiento, tomate y aceitunas.", "ingredientes": "Alubias blancas cocidas, bacalao desalado y desmigado, pimiento rojo y verde, cebolleta, tomate, aceitunas negras.", "instrucciones": "Mezclar todos los ingredientes, previamente cortados en dados pequeños. Aliñar con aceite de oliva, vinagre y sal.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=116" },
  { "id": 117, "titulo": "Sopa de Picadillo", "descripcion": "Sopa tradicional andaluza, un caldo de ave o cocido enriquecido con fideos, jamón serrano, huevo duro y pollo desmigado.", "ingredientes": "Caldo de cocido, fideos finos, jamón serrano en taquitos, huevo duro, pollo cocido.", "instrucciones": "Calentar el caldo. Añadir los fideos y cocer. Servir la sopa y en el último momento añadir el jamón, el huevo picado y el pollo desmigado.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=117" },
  { "id": 118, "titulo": "Revuelto de Espárragos Trigueros", "descripcion": "Un plato sencillo y rápido de huevos revueltos con espárragos trigueros y ajos tiernos.", "ingredientes": "Espárragos trigueros, huevos, ajos tiernos, gambas (opcional), aceite de oliva, sal.", "instrucciones": "Saltear los espárragos troceados y los ajos tiernos. Añadir las gambas si se usan. Verter los huevos batidos y remover hasta que cuajen al gusto.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=118" },
  { "id": 119, "titulo": "Borrajas con Patatas", "descripcion": "Plato típico de Aragón y Navarra, un guiso sencillo de borrajas cocidas con patatas y un refrito de ajos.", "ingredientes": "Borrajas, patatas, ajos, aceite de oliva virgen extra, sal.", "instrucciones": "Limpiar y cocer las borrajas junto con las patatas en dados. Escurrir. En una sartén, dorar ajos laminados en aceite y verter el refrito por encima.", "categoria": "Primero", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=119" },
  { "id": 120, "titulo": "Cardo con Almendras", "descripcion": "Cardo cocido en una suave salsa bechamel o velouté, enriquecida con almendras laminadas.", "ingredientes": "Cardo en conserva o fresco, harina, leche o caldo, almendras laminadas, ajo, aceite de oliva.", "instrucciones": "Cocer el cardo si es fresco. Hacer una salsa velouté con un refrito de ajos y harina, y caldo de la cocción. Incorporar el cardo y espolvorear almendras.", "categoria": "Primero", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=120" },
  { "id": 31, "titulo": "Paella Valenciana", "descripcion": "Arroz con pollo, conejo, judía verde y garrofón, cocinado en una paellera.", "ingredientes": "Arroz redondo, pollo, conejo, judía verde, garrofón, azafrán, tomate, aceite de oliva, agua.", "instrucciones": "Sofreír la carne y las verduras, añadir el arroz y el agua con azafrán. Cocinar hasta que el arroz esté en su punto.", "categoria": "Segundo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=31" },
  { "id": 32, "titulo": "Cochinillo Asado", "descripcion": "Elaborado cochinillo tierno asado al horno, crujiente por fuera y jugoso por dentro.", "ingredientes": "Cochinillo de Segovia, manteca de cerdo, agua, sal.", "instrucciones": "Asar el cochinillo al horno a temperatura baja por un lado y luego alta para dorar la piel.", "categoria": "Segundo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=32" },
  { "id": 33, "titulo": "Fideuá", "descripcion": "Plato similar a la paella, pero hecho con fideos en lugar de arroz, y mariscos.", "ingredientes": "Fideos, gambas, calamares, mejillones, pimiento, tomate, caldo de pescado, azafrán.", "instrucciones": "Sofreír el marisco y las verduras. Añadir los fideos y el caldo. Hornear o cocinar hasta que los fideos estén dorados.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=33" },
  { "id": 34, "titulo": "Lomo de Cerdo en Salsa Española", "descripcion": "Filetes de lomo de cerdo cocinados en una salsa rica a base de vino tinto y verduras.", "ingredientes": "Lomo de cerdo, cebolla, zanahoria, ajo, vino tinto, caldo de carne, harina, aceite de oliva.", "instrucciones": "Dorar el lomo, sofreír las verduras, añadir vino, caldo y el lomo. Cocinar a fuego lento hasta espesar.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=34" },
  { "id": 35, "titulo": "Cachopo Asturiano", "descripcion": "Dos filetes de ternera grandes rellenos de jamón serrano y queso, rebozados y fritos.", "ingredientes": "Filetes de ternera, jamón serrano, queso, harina, huevo, pan rallado.", "instrucciones": "Montar el cachopo, rebozar en harina, huevo y pan rallado, freír en abundante aceite.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=35" },
  { "id": 36, "titulo": "Falda de Cordero con Patatas al Ajillo", "descripcion": "Guiso tradicional de cordero y patatas con un sabor intenso a ajo y hierbas.", "ingredientes": "Falda de cordero, patatas, ajo, vino blanco, romero, tomillo, caldo de carne.", "instrucciones": "Dorar el cordero y las patatas. Guisar con ajo, vino y especias a fuego lento hasta que esté tierno.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=36" },
  { "id": 37, "titulo": "Albóndigas con Salsa de Almendras", "descripcion": "Jugosas albóndigas de carne en una salsa cremosa y delicada de almendras.", "ingredientes": "Carne picada, pan, leche, huevo, ajo, almendras, cebolla, caldo de carne, vino blanco.", "instrucciones": "Preparar las albóndigas, freírlas. Hacer la salsa con las almendras, cebolla y vino. Guisar las albóndigas en la salsa.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=37" },
  { "id": 38, "titulo": "Carrilleras de Cerdo al Vino Tinto", "descripcion": "Tiernas carrilleras estofadas en vino tinto, un plato meloso y con mucho sabor.", "ingredientes": "Carrilleras de cerdo, vino tinto, cebolla, zanahoria, puerro, caldo de carne, laurel.", "instrucciones": "Dorar las carrilleras, sofreír las verduras y estofarlo todo con vino tinto y caldo hasta que se deshaga la carne.", "categoria": "Segundo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=38" },
  { "id": 39, "titulo": "Calamares Encebollados", "descripcion": "Calamares cocinados lentamente con mucha cebolla hasta conseguir una salsa suave y dulce.", "ingredientes": "Calamares, cebolla, pimiento verde, tomate, vino blanco, aceite de oliva, sal.", "instrucciones": "Sofreír la cebolla y el pimiento. Añadir los calamares y cocinarlos en su jugo con el vino y el tomate.", "categoria": "Segundo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=39" },
  { "id": 40, "titulo": "Bacalao a la Vizcaína", "descripcion": "Bacalao confitado con una salsa de pimientos choriceros, cebolla y ajo.", "ingredientes": "Lomos de bacalao desalado, pimientos choriceros, cebolla, ajo, aceite de oliva.", "instrucciones": "Confitar el bacalao en aceite. Elaborar la salsa vizcaína con los pimientos choriceros y la cebolla.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=40" },
  { "id": 41, "titulo": "Cordero a la Caldereta", "descripcion": "Estofado de cordero popular en Extremadura y otras zonas, con especias y vino blanco.", "ingredientes": "Cordero, cebolla, pimiento, tomate, ajo, vino blanco, laurel, guindilla.", "instrucciones": "Sofreír las verduras y la carne. Guisar con vino blanco y especias hasta que el cordero esté tierno.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=41" },
  { "id": 42, "titulo": "Callos a la Madrileña", "descripcion": "Guiso tradicional de callos de ternera con chorizo, morcilla y un toque picante.", "ingredientes": "Callos de ternera, chorizo, morcilla, pata de ternera, pimentón, cebolla, ajo, laurel.", "instrucciones": "Cocer los callos con las carnes. Hacer un sofrito con las verduras y pimentón. Guisar todo junto.", "categoria": "Segundo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=42" },
  { "id": 43, "titulo": "Escalivada Catalana", "descripcion": "Verduras asadas (pimiento, berenjena, cebolla) aliñadas con aceite de oliva, perfecta para acompañar carnes.", "ingredientes": "Pimientos rojos, berenjenas, cebollas, aceite de oliva, sal.", "instrucciones": "Asar las verduras al horno, pelarlas y cortarlas en tiras. Aliñar.", "categoria": "Segundo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=43" },
  { "id": 44, "titulo": "Merluza en Salsa Verde", "descripcion": "Merluza cocinada en una salsa de ajo, perejil, vino blanco y caldo de pescado, con almejas y guisantes.", "ingredientes": "Lomos de merluza, almejas, guisantes, ajo, perejil, vino blanco, harina.", "instrucciones": "Sofreír el ajo y añadir harina. Incorporar el vino, el caldo, las almejas y la merluza. Espolvorear perejil.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=44" },
  { "id": 45, "titulo": "Conejo al Ajillo", "descripcion": "Trozos de conejo dorados y cocinados con ajo, vino blanco y hierbas aromáticas.", "ingredientes": "Conejo troceado, ajo, vino blanco, romero, tomillo, laurel, aceite de oliva.", "instrucciones": "Dorar el conejo. Freír los ajos y añadir el conejo, el vino y las hierbas. Cocinar a fuego lento.", "categoria": "Segundo", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=45" },
  { "id": 121, "titulo": "Rabo de Toro", "descripcion": "Guiso tradicional cordobés de rabo de toro o ternera, estofado lentamente en vino tinto hasta que la carne se desprende del hueso.", "ingredientes": "Rabo de toro o ternera, vino tinto, cebolla, zanahoria, ajo, laurel, aceite de oliva, sal.", "instrucciones": "Enharinar y dorar la carne. Pochar las verduras, añadir la carne, el vino y las hierbas. Guisar a fuego muy lento durante varias horas.", "categoria": "Segundo", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=121" },
  { "id": 122, "titulo": "Pollo al Chilindrón", "descripcion": "Pollo guisado en una salsa a base de pimientos, tomate y jamón, típico de Aragón y Navarra.", "ingredientes": "Pollo troceado, pimiento rojo, pimiento verde, cebolla, tomate, jamón serrano, ajo, vino blanco.", "instrucciones": "Dorar el pollo en una cazuela. Retirar y en el mismo aceite hacer un sofrito con las verduras. Incorporar el pollo, el jamón y el vino. Guisar a fuego lento.", "categoria": "Segundo", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=122" },
  { "id": 46, "titulo": "Arroz con Leche", "descripcion": "Postre tradicional de arroz cocido lentamente en leche con canela y limón.", "ingredientes": "Arroz, leche, azúcar, canela en rama, cáscara de limón.", "instrucciones": "Cocer el arroz con la leche y los aromatizantes a fuego muy lento, removiendo constantemente.", "categoria": "Postre", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=46" },
  { "id": 47, "titulo": "Leche Frita", "descripcion": "Un postre de origen castellano, con una masa frita y azucarada, suave por dentro y crujiente por fuera.", "ingredientes": "Harina, leche, azúcar, huevo, canela, cáscara de limón.", "instrucciones": "Hacer una masa con la leche, harina, azúcar y huevo. Enfriar, cortar, rebozar y freír.", "categoria": "Postre", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=47" },
  { "id": 48, "titulo": "Crema Catalana", "descripcion": "Crema pastelera con una capa de azúcar caramelizado por encima.", "ingredientes": "Yemas de huevo, azúcar, leche, maicena, canela, cáscara de limón.", "instrucciones": "Calentar la leche con la canela y limón. Hacer la crema y dejar enfriar. Quemar azúcar justo antes de servir.", "categoria": "Postre", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=48" },
  { "id": 49, "titulo": "Torrijas", "descripcion": "Rebanadas de pan empapadas en leche o vino, rebozadas en huevo, fritas y endulzadas.", "ingredientes": "Pan, leche, huevo, azúcar, canela, aceite de oliva.", "instrucciones": "Empapar el pan, rebozar en huevo, freír y espolvorear con azúcar y canela.", "categoria": "Postre", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=49" },
  { "id": 50, "titulo": "Sobaos Pasiegos", "descripcion": "Un bizcocho mantecoso y esponjoso de Cantabria, perfecto para el desayuno o la merienda.", "ingredientes": "Mantequilla, azúcar, huevos, harina, ralladura de limón, ron, levadura.", "instrucciones": "Batir la mantequilla con el azúcar. Añadir huevos y harina. Hornear en moldes rectangulares.", "categoria": "Postre", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=50" },
  { "id": 51, "titulo": "Flan de Huevo", "descripcion": "Delicioso postre de huevo y leche, cocinado al baño maría, con caramelo líquido.", "ingredientes": "Huevos, leche, azúcar, caramelo líquido.", "instrucciones": "Batir los huevos con azúcar y leche. Verter en moldes con caramelo y cocer al baño maría.", "categoria": "Postre", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=51" },
  { "id": 52, "titulo": "Tarta de Santiago", "descripcion": "Bizcocho tradicional gallego a base de almendras, con la cruz de Santiago en la superficie.", "ingredientes": "Almendras molidas, azúcar, huevos, canela, ralladura de limón, azúcar glas.", "instrucciones": "Mezclar los ingredientes y hornear. Una vez fría, espolvorear azúcar glas con la cruz de Santiago.", "categoria": "Postre", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=52" },
  { "id": 53, "titulo": "Natillas", "descripcion": "Crema de leche, yemas de huevo y azúcar, aromatizada con canela y limón.", "ingredientes": "Leche, yemas de huevo, azúcar, canela en rama, cáscara de limón, galletas.", "instrucciones": "Calentar la leche con la canela y el limón. Batir las yemas con azúcar. Unir y cocer sin que hierva. Servir con galletas.", "categoria": "Postre", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=53" },
  { "id": 54, "titulo": "Quesada Pasiega", "descripcion": "Tarta tradicional cántabra, a base de queso fresco y huevos.", "ingredientes": "Queso fresco, huevos, azúcar, mantequilla, harina, limón.", "instrucciones": "Mezclar todos los ingredientes y hornear hasta que cuaje y se dore.", "categoria": "Postre", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=54" },
  { "id": 55, "titulo": "Filloas Gallegas", "descripcion": "Similares a los crepes, pero más finas, tradicionalmente rellenas de dulces.", "ingredientes": "Harina, huevos, leche, agua, azúcar, sal.", "instrucciones": "Mezclar los ingredientes para la masa, dejar reposar. Cocinar en una sartén fina.", "categoria": "Postre", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=55" },
  { "id": 56, "titulo": "Melocotones en Vino", "descripcion": "Melocotones frescos macerados en vino tinto con azúcar y canela.", "ingredientes": "Melocotones maduros, vino tinto, azúcar, canela en rama.", "instrucciones": "Pelar y cortar los melocotones, cocer en vino con azúcar y canela a fuego lento.", "categoria": "Postre", "dificultad": "Baja", "imagen": "https://picsum.photos/400/250?random=56" },
  { "id": 57, "titulo": "Pestiños", "descripcion": "Dulce frito andaluz con masa de harina, ajonjolí y vino, bañado en miel.", "ingredientes": "Harina, ajonjolí, aceite de oliva, vino blanco, anís, miel.", "instrucciones": "Amasar los ingredientes, freír los pestiños y bañarlos en miel caliente.", "categoria": "Postre", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=57" },
  { "id": 58, "titulo": "Buñuelos de Viento", "descripcion": "Pequeñas bolitas de masa frita, muy ligeras, que se suelen rellenar con crema.", "ingredientes": "Agua, mantequilla, harina, huevos, azúcar glas, crema pastelera.", "instrucciones": "Hacer la masa 'choux', freír los buñuelos y, una vez fríos, rellenar con crema.", "categoria": "Postre", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=58" },
  { "id": 59, "titulo": "Ensaimada de Mallorca", "descripcion": "Postre en forma de espiral, con una masa dulce y esponjosa, típica de las Islas Baleares.", "ingredientes": "Harina de fuerza, agua, azúcar, huevos, masa madre, manteca de cerdo.", "instrucciones": "Amasar la masa y dejarla fermentar. Estirarla, untar con manteca y enrollarla en forma de espiral. Hornear.", "categoria": "Postre", "dificultad": "Alta", "imagen": "https://picsum.photos/400/250?random=59" },
  { "id": 60, "titulo": "Pantxineta", "descripcion": "Pastel vasco de hojaldre relleno de crema y cubierto de almendras.", "ingredientes": "Hojaldre, yemas de huevo, leche, azúcar, almendras, mantequilla.", "instrucciones": "Hacer la crema pastelera. Montar el pastel con el hojaldre, la crema y las almendras. Hornear.", "categoria": "Postre", "dificultad": "Media", "imagen": "https://picsum.photos/400/250?random=60" }
]
